### Recommendations with MovieTweetings: Getting to Know The Data

Throughout this lesson, you will be working with the [MovieTweetings Data](https://github.com/sidooms/MovieTweetings/tree/master/recsyschallenge2014).

**Note:** There are solutions to each of the notebooks available by hitting the orange jupyter logo in the top left of this notebook.  Additionally, you can watch me work through the solutions on the screencasts that follow each workbook. 

To get started, read in the libraries and the two datasets you will be using throughout the lesson using the code below.

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import tests as t

%matplotlib inline


# Read in the MovieTweetings dataset originally taken from https://github.com/sidooms/MovieTweetings/tree/master/latest
movies = pd.read_csv('movies.dat', delimiter='::', header=None, names=['movie_id', 'movie', 'genre'], dtype={'movie_id': object}, engine='python')
reviews = pd.read_csv('ratings.dat', delimiter='::', header=None, names=['user_id', 'movie_id', 'rating', 'timestamp'], dtype={'movie_id': object, 'user_id': object, 'timestamp': object}, engine='python')

#### 1. Take a Look At The Data 

Take a look at the data and use your findings to fill in the dictionary below with the correct responses to show your understanding of the data.

In [2]:
# cell for work
movies.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 35479 entries, 0 to 35478
Data columns (total 3 columns):
movie_id    35479 non-null object
movie       35479 non-null object
genre       35230 non-null object
dtypes: object(3)
memory usage: 831.6+ KB

In [3]:
# cell for work
reviews.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 863866 entries, 0 to 863865
Data columns (total 4 columns):
user_id      863866 non-null object
movie_id     863866 non-null object
rating       863866 non-null int64
timestamp    863866 non-null object
dtypes: int64(1), object(3)
memory usage: 26.4+ MB

In [4]:
# more work
movies.describe()

       movie_id        movie  genre
count     35479        35479  35230
unique    35479        35416   2736
top     5805768  Home (2016)  Drama
freq          1            4   3602

In [5]:
# and still more
reviews.describe()

              rating
count  863866.000000
mean        7.315878
std         1.853831
min         0.000000
25%         6.000000
50%         8.000000
75%         9.000000
max        10.000000

In [6]:
# and even more - open additional cells as necessary
movies.head()

,movie_id,movie,genre
0,0000008,Edison Kinetoscopic Record of a Sneeze (1894),Documentary|Short
1,0000010,La sortie des usines Lumière (1895),Documentary|Short
2,0000012,The Arrival of a Train (1896),Documentary|Short
3,25,The Oxford and Cambridge University Boat Race ...,NaN
4,0000091,Le manoir du diable (1896),Short|Horror

In [7]:
movies.movie[0][-5:-1]

'1894'

In [8]:
movies.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 35479 entries, 0 to 35478
Data columns (total 3 columns):
movie_id    35479 non-null object
movie       35479 non-null object
genre       35230 non-null object
dtypes: object(3)
memory usage: 831.6+ KB

In [9]:
reviews.shape

(863866, 4)

In [10]:
reviews.head()

  user_id  movie_id  rating   timestamp
0       1   0114508       8  1381006850
1       2   0208092       5  1586466072
2       2   0358273       9  1579057827
3       2  10039344       5  1578603053
4       2   6751668       9  1578955697

In [11]:
reviews.rating.mean()

7.3158776939942074

In [12]:
genres = []
for gen in movies.genre:
    try :
        genres.extend(gen.split('|'))
    except AttributeError:
        pass
genres = set(genres)
print ("The total number of genres is {}".format(len(genres)))

The total number of genres is 28

In [13]:
# Use your findings to match each variable to the correct statement in the dictionary

a = movies.movie_id.nunique()
b = reviews.shape[0]
c = len(genres)
d = reviews.user_id.nunique()
e = reviews.isnull().any().sum()
f = np.round(reviews.rating.mean(),0)
g = reviews.rating.min()
h = reviews.rating.max()

dict_sol1 = {
'The number of movies in the dataset': a ,
'The number of ratings in the dataset': b ,
'The number of different genres': c,
'The number of unique users in the dataset': d,
'The number missing ratings in the reviews dataset': e,
'The average rating given across all ratings': f,
'The minimum rating given across all ratings': g,
'The maximum rating given across all ratings': h,
}

# Originally, I had this to check your solution, but the 
# links are live and updating.  That didn't end up being
# a great idea
# Check your solution
t.q1_check(dict_sol1)

That looks good to me!

#### 2. Data Cleaning

Next, we need to pull some additional relevant information out of the existing columns. 

For each of the datasets, there are a couple of cleaning steps we need to take care of:

#### Movies
* Pull the date from the title and create new column
* Dummy the date column with 1's and 0's for each century of a movie (1800's, 1900's, and 2000's)
* Dummy column the genre with 1's and 0's

#### Reviews
* Create a date out of time stamp

You can check your results against the header of my solution by running the cell below with the **show_clean_dataframes** function.

In [14]:
# cell for work
create_date = lambda val : val [-5:-1] if val [-1] == ')' else np.nan

In [15]:
# and another
movies['date'] = movies['movie'].apply(create_date)

In [16]:
# and a few more below, which you can use as necessary
def create_century (year):
    if year[:2] == val :
        return 1
    else:
        return 0
    
## apply function
for val in ["18","19","20"]:
    movies[str(val) + "00's"] = movies['date'].apply(create_century)

In [17]:
movies.head()

,movie_id,movie,genre,date,1800's,1900's,2000's
0,0000008,Edison Kinetoscopic Record of a Sneeze (1894),Documentary|Short,1894,1,0,0
1,0000010,La sortie des usines Lumière (1895),Documentary|Short,1895,1,0,0
2,0000012,The Arrival of a Train (1896),Documentary|Short,1896,1,0,0
3,25,The Oxford and Cambridge University Boat Race ...,NaN,1895,1,0,0
4,0000091,Le manoir du diable (1896),Short|Horror,1896,1,0,0

In [18]:
movies.date[0][:2]

'18'

In [19]:
movies.genre.nunique()

2736

In [20]:
genres

{'Action',
 'Adult',
 'Adventure',
 'Animation',
 'Biography',
 'Comedy',
 'Crime',
 'Documentary',
 'Drama',
 'Family',
 'Fantasy',
 'Film-Noir',
 'Game-Show',
 'History',
 'Horror',
 'Music',
 'Musical',
 'Mystery',
 'News',
 'Reality-TV',
 'Romance',
 'Sci-Fi',
 'Short',
 'Sport',
 'Talk-Show',
 'Thriller',
 'War',
 'Western'}

In [21]:
movies.genre[0]

'Documentary|Short'

In [22]:
movies.genre[0].find("Documentary")

0

In [23]:
def split_genres(val):
    try:
        if gen.find(gen) >-1:
            return 1
        else:
            return 0
    except AttributeError:
        return 0

In [24]:
for gen in genres:
    movies[gen] = movies['genre'].apply(split_genres)

In [26]:
reviews.head()

  user_id  movie_id  rating   timestamp
0       1   0114508       8  1381006850
1       2   0208092       5  1586466072
2       2   0358273       9  1579057827
3       2  10039344       5  1578603053
4       2   6751668       9  1578955697

In [27]:
import datetime
change_timestamp = lambda val: datetime.datetime.fromtimestamp(int(val)).strftime("%Y-%m-%d-%H-%M-%S")
reviews["date"] = reviews['timestamp'].apply(change_timestamp)

In [28]:
reviews.head()

  user_id  movie_id  rating   timestamp                 date
0       1   0114508       8  1381006850  2013-10-05-21-00-50
1       2   0208092       5  1586466072  2020-04-09-21-01-12
2       2   0358273       9  1579057827  2020-01-15-03-10-27
3       2  10039344       5  1578603053  2020-01-09-20-50-53
4       2   6751668       9  1578955697  2020-01-13-22-48-17

In [25]:
movies.head()

,movie_id,movie,genre,date,1800's,1900's,2000's,Biography,Sci-Fi,Drama,...,Musical,Reality-TV,Adventure,Crime,Action,Sport,Fantasy,History,War,Romance
0,0000008,Edison Kinetoscopic Record of a Sneeze (1894),Documentary|Short,1894,1,0,0,1,1,1,...,1,1,1,1,1,1,1,1,1,1
1,0000010,La sortie des usines Lumière (1895),Documentary|Short,1895,1,0,0,1,1,1,...,1,1,1,1,1,1,1,1,1,1
2,0000012,The Arrival of a Train (1896),Documentary|Short,1896,1,0,0,1,1,1,...,1,1,1,1,1,1,1,1,1,1
3,25,The Oxford and Cambridge University Boat Race ...,NaN,1895,1,0,0,1,1,1,...,1,1,1,1,1,1,1,1,1,1
4,0000091,Le manoir du diable (1896),Short|Horror,1896,1,0,0,1,1,1,...,1,1,1,1,1,1,1,1,1,1

In [29]:
reviews_new, movies_new = t.show_clean_dataframes()

   Unnamed: 0  user_id  movie_id  rating   timestamp                 date
0           0        1    114508       8  1381006850  2013-10-05 21:00:50
1           1        2    208092       5  1586466072  2020-04-09 21:01:12
2           2        2    358273       9  1579057827  2020-01-15 03:10:27
3           3        2  10039344       5  1578603053  2020-01-09 20:50:53
4           4        2   6751668       9  1578955697  2020-01-13 22:48:17
   Unnamed: 0  movie_id                                              movie  \
0           0         8      Edison Kinetoscopic Record of a Sneeze (1894)
1           1        10                La sortie des usines Lumière (1895)
2           2        12                      The Arrival of a Train (1896)
3           3        25  The Oxford and Cambridge University Boat Race ...
4           4        91                         Le manoir du diable (1896)

               genre  date  1800's  1900's  2000's  Adventure  Fantasy  \
0  Documentary|Short  1894       1       0       0          0        0
1  Documentary|Short  1895       1       0       0          0        0
2  Documentary|Short  1896       1       0       0          0        0
3                NaN  1895       1       0       0          0        0
4       Short|Horror  1896       1       0       0          0        0

    ...     Thriller  Action  Western  Documentary  Sport  Game-Show  \
0   ...            0       0        0            1      0          0
1   ...            0       0        0            1      0          0
2   ...            0       0        0            1      0          0
3   ...            0       0        0            0      0          0
4   ...            0       0        0            0      0          0

   Animation  War  Biography  Mystery
0          0    0          0        0
1          0    0          0        0
2          0    0          0        0
3          0    0          0        0
4          0    0          0        0

[5 rows x 36 columns]

In [30]:
## save our new csv files
reviews.to_csv('./reviews_clean.csv')
movies.to_csv('./movies_clean.csv')